<?php

use App\Models\ServiceType;
use Illuminate\Database\Seeder;

class ServiceTypeSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $serviceTypes = $this->data();
        foreach ($serviceTypes as $serviceType) {
            ServiceType::create($serviceType);
        }
    }

    private function data()
    {
        return [
            [
                'name' => '送货到楼下',
                'description' => '师傅从订单信息中的物流点提货，将订单中指定的商品配送至客户地址的楼下，不含搬楼，只验收商品外包装。'
            ],
            [
                'name' => '送货到家',
                'description' => '师傅从订单信息中的物流点提货，将订单中指定的商品配送至客户地址的家中，含搬楼（3层以下免费搬楼，超出每层收费10元/件），可拆包验收货物。'
            ],
            [
                'name' => '送货到家并安装',
                'description' => '师傅从订单信息中的物流点提货，将订单中指定的商品配送至客户地址的家中并安装商品，含搬楼（3层以下免费搬楼，超出每层收费10元/件）。'
            ],
            [
                'name' => '安装',
                'description' => '师傅到客户的家中安装订单中指定的商品，不含配送、搬楼、维修等服务。'
            ],
            [
                'name' => '维修',
                'description' => '师傅到客户家中维修订单中指定商品。维修无法保证商品100%还原，如师傅全力维修后仍无法达到客户要求，风险需用户自行承担。'
            ],
            [
                'name' => '返货',
                'description' => '师傅到客户家中取走订单指定商品，并配送至物流点寄回给商家，可要求师傅自带包装（不含打木架）。用户需承担商品拆卸存在的风险。',
                'tips' => [
                    'remark' => '由于物流运输过程中产生的问题较多，返货类订单，目前暂不支持“先行赔付”。',
                    'normal' => [
                        [
                            'title' => '关于报价',
                            'content' => [
                                '由于返货类订单，涉及拆卸、重新打包、运输、寻找物流等流程，师傅所需要的时间成本比较高，因此返货报价会相对偏高。'
                            ]
                        ],
                        [
                            'title' => '关于自带包装',
                            'content' => [
                                '平台默认师傅上门返货无需带包装，若需要师傅带包装，请您在下单时选择',
                                '师傅自带的包装一般比较简易，有可能出现物流不认可需要重新打包，或包装不符合您的预期的情况。如果您对包装有要求，建议雇佣师傅后电话沟通清楚。（例如：需要做保护措施等）'
                            ]
                        ],
                        [
                            'title' => '关于打包',
                            'content' => [
                                '商品一旦拆包组装后，无法做到像出厂一样原样装回',
                                '师傅非专业打包人员，仅能尽力做好基础打包，整齐摆放',
                                '为了您的商品运回更有保障，如果您需要打木架，建议下单时，直接选择需要物流打木架，由物流提供专业的打木架服务'
                            ]
                        ],
                        [
                            'title' => '关于物流',
                            'content' => [
                                '如您对物流公司有要求，或对物流价格有要求，请在下单时直接选好物流公司，避免出现师傅选择的物流不符合您预期的情况',
                                '由于物流点差异，部分物流点无法接收大型货物，会出现需要临时更换物流的情况'
                            ]
                        ]
                    ]
                ]
            ],
            [
                'name' => '保养',
                'description' => '师傅到客户的家中对订单中指定的商品进行保养，不含配送、搬楼、维修等服务。'
            ]
        ];
    }
}
